Repository: jamesDeveloper07/employee-management
Catalog: src/Services/Employee/Employee.Domain/Resources/DomainExceptions.*.resx
Languages: pt_br

source: First name cannot be empty
pt_br: Primeiro nome não pode estar vazio

source: Last name cannot be empty
pt_br: Sobrenome não pode estar vazio

source: Salary must be greater than zero
pt_br: Salário deve ser maior que zero

source: Position cannot be empty
pt_br: Cargo não pode estar vazio

# BirthDateMustBeInPast
source: Birth date must be in the past
pt_br: Data de nascimento deve estar no passado

# HireDateCannotBeInFuture
source: Hire date cannot be in the future
pt_br: Data de contratação não pode estar no futuro

source: Department name cannot be empty
pt_br: Nome do departamento não pode estar vazio

source: Department description cannot be empty
pt_br: Descrição do departamento não pode estar vazia

source: CPF cannot be empty
pt_br: CPF não pode estar vazio

source: CPF must have 11 digits
pt_br: CPF deve ter 11 dígitos

source: Invalid CPF
pt_br: CPF inválido

source: Email cannot be empty
pt_br: Email não pode estar vazio

source: Invalid email format
pt_br: Formato de email inválido

source: Phone number cannot be empty
pt_br: Telefone não pode estar vazio

source: Phone number must have 10 or 11 digits
pt_br: Telefone deve ter 10 ou 11 dígitos

source: Street cannot be empty
pt_br: Rua não pode estar vazia

source: Number cannot be empty
pt_br: Número não pode estar vazio

source: Neighborhood cannot be empty
pt_br: Bairro não pode estar vazio

source: City cannot be empty
pt_br: Cidade não pode estar vazia

source: State cannot be empty
pt_br: Estado não pode estar vazio

source: ZipCode cannot be empty
pt_br: CEP não pode estar vazio

source: Country cannot be empty
pt_br: País não pode estar vazio

# EmployeeWithCPFAlreadyExists
source: Employee with CPF {0} already exists
pt_br: Funcionário com CPF {0} já existe

# EmployeeNotFound
source: Employee with ID {0} not found
pt_br: Funcionário com ID {0} não encontrado
