Repository: jamesDeveloper07/employee-management
Catalog: src/Services/Employee/Employee.Application/Resources/ValidationMessages.*.resx
Languages: pt_br

# Required
source: {0} is required
pt_br: {0} é obrigatório

# MaxLength
source: {0} must not exceed {1} characters
pt_br: {0} não deve exceder {1} caracteres

# ExactLength
source: {0} must be {1} characters
pt_br: {0} deve ter {1} caracteres

# GreaterThanZero
source: {0} must be greater than zero
pt_br: {0} deve ser maior que zero

# InvalidFormat
source: Invalid {0} format
pt_br: Formato inválido para {0}

# MustBeInPast
source: {0} must be in the past
pt_br: {0} deve estar no passado

# CannotBeInFuture
source: {0} cannot be in the future
pt_br: {0} não pode estar no futuro

# FirstName_Required
source: First name is required
pt_br: Primeiro nome é obrigatório

# FirstName_MaxLength
source: First name must not exceed 100 characters
pt_br: Primeiro nome não deve exceder 100 caracteres

# LastName_Required
source: Last name is required
pt_br: Sobrenome é obrigatório

# LastName_MaxLength
source: Last name must not exceed 100 characters
pt_br: Sobrenome não deve exceder 100 caracteres

# CPF_Required
source: CPF is required
pt_br: CPF é obrigatório

# CPF_InvalidFormat
source: CPF must be in format 00000000000 or 000.000.000-00
pt_br: CPF deve estar no formato 00000000000 ou 000.000.000-00

# Email_Required
source: Email is required
pt_br: Email é obrigatório

# Email_InvalidFormat
source: Invalid email format
pt_br: Formato de email inválido

# PhoneNumber_Required
source: Phone number is required
pt_br: Telefone é obrigatório

# PhoneNumber_InvalidFormat
source: Phone number must have 10 or 11 digits
pt_br: Telefone deve ter 10 ou 11 dígitos

# Street_Required
source: Street is required
pt_br: Rua é obrigatória

# Street_MaxLength
source: Street must not exceed 200 characters
pt_br: Rua não deve exceder 200 caracteres

# Number_Required
source: Number is required
pt_br: Número é obrigatório

# Number_MaxLength
source: Number must not exceed 20 characters
pt_br: Número não deve exceder 20 caracteres

# Neighborhood_Required
source: Neighborhood is required
pt_br: Bairro é obrigatório

# Neighborhood_MaxLength
source: Neighborhood must not exceed 100 characters
pt_br: Bairro não deve exceder 100 caracteres

# City_Required
source: City is required
pt_br: Cidade é obrigatória

# City_MaxLength
source: City must not exceed 100 characters
pt_br: Cidade não deve exceder 100 caracteres

# State_Required
source: State is required
pt_br: Estado é obrigatório

# State_ExactLength
source: State must be 2 characters
pt_br: Estado deve ter 2 caracteres

# ZipCode_Required
source: ZipCode is required
pt_br: CEP é obrigatório

# ZipCode_InvalidFormat
source: ZipCode must be in format 00000000 or 00000-000
pt_br: CEP deve estar no formato 00000000 ou 00000-000

# BirthDate_Required
source: Birth date is required
pt_br: Data de nascimento é obrigatória

# BirthDate_MustBeInPast
source: Birth date must be in the past
pt_br: Data de nascimento deve estar no passado

# HireDate_Required
source: Hire date is required
pt_br: Data de contratação é obrigatória

# HireDate_CannotBeInFuture
source: Hire date cannot be in the future
pt_br: Data de contratação não pode estar no futuro

# Salary_GreaterThanZero
source: Salary must be greater than zero
pt_br: Salário deve ser maior que zero

# Position_Required
source: Position is required
pt_br: Cargo é obrigatório

# Position_MaxLength
source: Position must not exceed 100 characters
pt_br: Cargo não deve exceder 100 caracteres

# DepartmentId_Required
source: Department is required
pt_br: Departamento é obrigatório

# EmployeeId_Required
source: Employee ID is required
pt_br: ID do funcionário é obrigatório
